In [1]:
import pandas as pd
import numpy as np

In [24]:
df = pd.read_csv("E://DATA SETS//propData_c.csv")
df

,Unnamed: 0,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,0,100001000.0,104.0,PUTNAM,True,3.0,1.0,1000.0
1,1,100002000.0,197.0,LEXINGTON,False,3.0,1.5,NaN
2,2,100003000.0,NaN,LEXINGTON,False,NaN,1.0,850.0
3,3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,4,NaN,203.0,BERKELEY,True,3.0,2.0,1600.0
5,5,100006000.0,207.0,BERKELEY,True,NaN,1.0,800.0
6,6,100007000.0,NaN,WASHINGTON,NaN,2.0,NaN,950.0
7,7,100008000.0,213.0,TREMONT,True,1.0,1.0,NaN
8,8,100009000.0,215.0,TREMONT,True,NaN,2.0,1800.0

In [25]:
df.dtypes

Unnamed: 0        int64
PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS    float64
NUM_BATH        float64
SQ_FT           float64
dtype: object

### impilict conversion

In [26]:
df = df.convert_dtypes()
df.dtypes

Unnamed: 0        Int64
PID               Int64
ST_NUM            Int64
ST_NAME          string
OWN_OCCUPIED    boolean
NUM_BEDROOMS      Int64
NUM_BATH        Float64
SQ_FT             Int64
dtype: object

### explicit conversion

In [27]:
df['SQ_FT'] = df.SQ_FT.astype('float32')
df.dtypes

Unnamed: 0        Int64
PID               Int64
ST_NUM            Int64
ST_NAME          string
OWN_OCCUPIED    boolean
NUM_BEDROOMS      Int64
NUM_BATH        Float64
SQ_FT           float32
dtype: object

In [28]:
df

,Unnamed: 0,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,0,100001000,104,PUTNAM,True,3,1.0,1000.0
1,1,100002000,197,LEXINGTON,False,3,1.5,NaN
2,2,100003000,<NA>,LEXINGTON,False,<NA>,1.0,850.0
3,3,100004000,201,BERKELEY,<NA>,1,<NA>,700.0
4,4,<NA>,203,BERKELEY,True,3,2.0,1600.0
5,5,100006000,207,BERKELEY,True,<NA>,1.0,800.0
6,6,100007000,<NA>,WASHINGTON,<NA>,2,<NA>,950.0
7,7,100008000,213,TREMONT,True,1,1.0,NaN
8,8,100009000,215,TREMONT,True,<NA>,2.0,1800.0

In [29]:
df.dtypes

Unnamed: 0        Int64
PID               Int64
ST_NUM            Int64
ST_NAME          string
OWN_OCCUPIED    boolean
NUM_BEDROOMS      Int64
NUM_BATH        Float64
SQ_FT           float32
dtype: object